{"config": {"name": "model_1", "layers": [{"name": "encoder_inputs", "config": {"name": "encoder_inputs", "dtype": "float32", "batch_input_shape": [null, null], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "encoder_embedding", "config": {"mask_zero": false, "trainable": true, "embeddings_regularizer": null, "input_dim": 5002, "name": "encoder_embedding", "dtype": "float32", "batch_input_shape": [null, 500], "input_length": 500, "embeddings_constraint": null, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "output_dim": 100}, "class_name": "Embedding", "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]]}, {"name": "decoder_inputs", "config": {"name": "decoder_inputs", "dtype": "float32", "batch_input_shape": [null, null, 2001], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "encoder_lstm", "config": {"kernel_constraint": null, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "name": "encoder_lstm", "kernel_regularizer": null, "go_backwards": false, "activation": "tanh", "recurrent_dropout": 0.0, "dropout": 0.0, "units": 100, "trainable": true, "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "unroll": false, "implementation": 1, "return_state": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "return_sequences": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null}, "class_name": "LSTM", "inbound_nodes": [[["encoder_embedding", 0, 0, {}]]]}, {"name": "decoder_lstm", "config": {"kernel_constraint": null, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "name": "decoder_lstm", "kernel_regularizer": null, "go_backwards": false, "activation": "tanh", "recurrent_dropout": 0.0, "dropout": 0.0, "units": 100, "trainable": true, "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "unroll": false, "implementation": 1, "return_state": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null}, "class_name": "LSTM", "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]]}, {"name": "decoder_dense", "config": {"trainable": true, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "decoder_dense", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 2001, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]]}], "output_layers": [["decoder_dense", 0, 0]], "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.2"}